"USSD_ERROR" = "Error al fer la sol·licitud";
"USSD_TERMINATED" = "Sessió cancel·lada";

"%@ Call Forwarding\n%@\n%@%@" = "%@Desviament de trucades\n%@\n%@%@";
"%@ Call Waiting\n%@" = "%@ Trucada en espera\n%@";
"%@ Call Barring\n%@\n%@" = "%@ Bloqueig de trucades\n%@\n%@";
"%@ Fixed Dialing\n%@" = "%@ Marcatge fix\n%@";
"Connected Line Presentation\n%@" = "Presentació de número connectat\n%@";
"Calling Line Presentation\n%@" = "Presentació de número entrant\n%@";
"Connected Line ID Restriction\n%@" = "Restricció d'ID de trucada connectada\n%@";
"Calling Line ID Restriction\n%@" = "Restricció d'ID de trucada entrant\n%@";
"SIM Lock\n%@" = "Bloqueig de SIM\n%@";
"Service Center Address\n%@" = "Adreça del centre de servei\n%@";
"Supplementary Service Password\n%@" = "Contrasenya de servei complementari\n%@";
"Calling Name Presentation\n%@" = "Presentació de nom entrant\n%@";

"Forwards to %@\n" = "Desviament a %@\n";

"All Calls" = "Totes les trucades";
"All Conditional Calls" = "Totes les trucades condicionals";
"Async Data Circuit" = "Circuit de dades asíncron";
"Data" = "Dades";
"Fax" = "Fax";
"Packet Access" = "Accés de paquets";
"Pad Access" = "Accés al teclat";
"SMS" = "SMS";
"Sync Data Circuit" = "Circuit de dades síncron";
"Voice" = "Veu";

"All Outgoing" = "Totes les sortints";
"All Incoming" = "Totes les entrants";
"Outgoing International" = "Fer trucades internacionals";
"Outgoing International, Except Home Country" = "Fer trucades internacionals, excepte al país propi";
"Incoming While Roaming Outside Home Country" = "Rebre trucades en itinerància a l’estranger";
"Incoming, Not On SIM" = "D’entrada, no incloses a la SIM";
"All Services" = "Tots els serveis";
"All Outgoing Services" = "Tots els serveis sortints";
"All Incoming Services" = "Tots els serveis entrants";

"Disabled" = "Desactivat";
"Enabled" = "Activat";

"On All Calls" = "En totes les trucades";
"When Busy" = "Quan comuniqui";
"When Unanswered" = "Quan no contesti";
"When Unreachable" = "Quan no estigui disponible";

"Setting %@ Succeeded" = "Configuració de %@ completada\n";
"Setting Interrogation Succeeded" = "Configuració de consulta completada\n";
"Setting %@ Failed" = "Error de configuració de %@\n";
"Setting Interrogation Failed" = "Error de configuració de consulta\n";

"Not Available" = "No disponible";
"Network Controlled" = "Xarxa controlada";
"Temporarily Disabled" = "Desactivat temporalment";
"Temporarily Enabled" = "Activat temporalment";
"Unknown" = "Desconegut";

"Activation" = "Activació";
"Deactivation" = "Desactivació";
"Interrogation" = "Consulta";
"Registration" = "Registre";
"Erasure" = "Eliminació";

"No Address" = "Sense adreça";
"No Service Specified" = "Cap servei especificat";
"Type %d" = "Tipus %d";

// generic error
"CALL_FAILED" = "Error en la trucada";
// error codes
"kCTNoError" = "Cap error";
"kCTUnknownError" = "Error desconegut";
"kCTErrorRadioFailure" = "Error de la ràdio";
// Generic network errors
"kCTErrorNetworkFailure" = "Error de xarxa";
"kCTErrorCongestion" = "Xarxa col·lapsada";
"kCTErrorUnidentifiedSubscriber" = "Subscriptor no identificat";
"kCTErrorFacilityRejected" = "Servei refusat";
"kCTErrorUnknownSubscriber" = "Subscriptor desconegut";
"kCTErrorNetworkOutOfOrder" = "Xarxa fora de servei";
"kCTErrorInvalidTransactionIdentifier" = "Identificador de transacció no vàlid";
"kCTErrorSemanticallyIncorrectMessage" = "Missatge semànticament incorrecte";
"kCTErrorInvalidMandatoryInformation" = "Informació obligatòria no vàlida";
"kCTErrorMessageTypeNonExistant" = "Tipus de missatge no existent";
"kCTErrorMessageNotCompatibleWithProtocolState" = "Missatge no compatible amb l’estat del protocol";
"kCTErrorInformationElementNonExistant" = "Element d’informació no existent";
"kCTErrorProtocolErrorUnspecified" = "Error de protocol indeterminat";
"kCTErrorTemporaryFailure" = "Error temporal";
"kCTErrorResourcesUnavailable" = "Recursos no disponibles";
"kCTErrorRequestedFacilityNotSubscribed" = "No esteu subscrit al servei sol·licitat";
"kCTErrorRequestedFacilityNotImplemented" = "El servei sol·licitat no està implementat";
"kCTErrorInterworkingError" = "Error d’interacció";
"kCTErrorInterworkingNotSupported" = "Interacció no admesa";
"kCTErrorCommandCannotBeActioned" = "No es pot activar l’ordre";
"kCTErrorNoNetworkService" = "Sense servei de xarxa";
// Call related errors
"kCTErrorUnassignedNumber" = "Número no assignat";
"kCTErrorOperatorDeterminedBarring" = "Bloqueig decidit per l’operador";
"kCTErrorCallBarred" = "Trucada bloquejada";
"kCTErrorUserBusy" = "L’usuari comunica";
"kCTErrorNoUserResponding" = "Cap usuari no respon";
"kCTErrorNumberChanged" = "El número ha canviat";
"kCTErrorInvalidNumberFormat" = "Format de número no vàlid";
"kCTErrorCallRejected" = "Trucada refusada";
// SIM errors
"kCTErrorSimNotInserted" = "SIM no inserida";
"kCTErrorSimPinRequired" = "SIM amb PIN obligatori";
"kCTErrorSimPukRequired" = "PUK de la SIM necessari";
"kCTErrorSimFailure" = "Error de la SIM";
"kCTErrorSimMemoryFailure" = "Error de memòria de la SIM";
"kCTBadPinFormatError" = "Format de PIN incorrecte";
"kCTErrorNumberNotAllowed" = "Número no permès";
"kCTErrorIncorrectPassword" = "Contrasenya incorrecta";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "Transferència del missatge curt refusada";
"kCTErrorDestinationOutOfOrder" = "Destinació fora de servei";
"kCTErrorClass0NotSupported" = "Classe 0 no acceptada";
"kCTErrorCannotReplaceSm" = "No es pot substituir la SIM";
"kCTErrorUnspecifiedPid" = "PID no especificat";
"kCTErrorDataCodingSchemeNotSupported" = "Esquema de codificació de dades no admès";
"kCTErrorUnspecifiedDcs" = "Error DCS indeterminat";
"kCTErrorCommandUnsupported" = "Ordre no compatible";
"kCTErrorUnspecifiedTpCommand" = "Error d’ordre TP indeterminat";
"kCTErrorTpduNotSupported" = "TPDU no admès";
"kCTErrorScBusy" = "SC ocupat";
"kCTErrorRejectedBySimSmsControl" = "Refusat pel control d'SMS del SIM";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "MS il·legal de GPRS";
"kCTErrorGprsIllegalMe" = "ME il·legal de GPRS";
"kCTErrorGprsServicesNotAllowed" = "Serveis GPRS no permesos";
"kCTErrorGprsPlmnNotAllowed" = "GPRS PLMN no permès";
"kCTErrorGprsLocationAreaNotAllowed" = "Zona d’ubicació GPRS no permesa";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "Itinerància GPRS no permesa en aquesta ubicació";
"kCTErrorGprsServiceOptionNotSupported" = "Opció de servei GPRS no permesa";
"kCTErrorGprsServiceOptionNotSubscribed" = "Opció de servei GPRS no subscrita";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "Opció de servei GPRS fora de servei temporalment";
"kCTErrorGprsPdpAuthenticationFailure" = "Error d’autenticació GPRS PDP";
"kCTErrorGprsInvalidMobileClass" = "Classe de mòbil GPRS no vàlida";
"kCTErrorGprsUnspecified" = "GPRS indeterminat";
"kCTErrorGprsMissingorUnknownAPN" = "GPRS no trobat o APN desconeguda";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "Dades d'autenticació GPRS PDP refusades per la banda de base";
